cf_billing/InformationRegisters/энргСтатусВыполненияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтатусВыполненияСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Указывает выполнено ли событие или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСобытие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтатусВыполненияСобытий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область РегистрацияДанных

// Процедура - Зарегистрировать статус выполнен
//
// Параметры:
//  Период			 - Дата - Период.
//  ДанныеЗаполнения - Структура - Данные заполнения. 
//
Процедура ЗарегистрироватьСтатусВыполнен(Период, ДанныеЗаполнения) Экспорт 
	ЗарегистрироватьДанныеПоУмолчанию(Период, ДанныеЗаполнения);
КонецПроцедуры

// Процедура - Зарегистрировать статус не выполнено
//
// Параметры:
//  Период			 - Дата - Период.
//  ДанныеЗаполнения - Структура - Данные заполнения. 
//
Процедура ЗарегистрироватьСтатусНеВыполнено(Период, ДанныеЗаполнения) Экспорт 
	ЗарегистрироватьДанныеПоУмолчанию(Период, ДанныеЗаполнения);
КонецПроцедуры

Процедура ЗарегистрироватьДанныеПоУмолчанию(Период, ДанныеЗаполнения) 
	МенеджерЗаписи 			= СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период 	= Период;
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаполнения);
	
	МенеджерЗаписи.Записать();
КонецПроцедуры
	
#КонецОбласти

#Область ПолучениеДанных

#Если Сервер Тогда
	
// Процедура - Статус выполнения событий
//
// Параметры:
//  Схема				 - СхемаЗапроса - Схема запроса. 
//  ПараметрыОтбора		 - Структура 	- Параметры отбора.  
//  ТаблицаДляПомещения	 - Строка 		- Имя таблицы помещения. 
//
Процедура СтатусВыполненияСобытий(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтатусВыполненияСобытий());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	
	ПараметрПериод 						= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация,Район,ДокРегистратор";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыОтбора") Тогда
		ДоступныеПараметры = "Статус";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор, "энргСтатусСогласованияСобытийСрезПоследних", ПараметрыОтбора.ПараметрыОтбора, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти 

 #Область ВспомогательныеМетоды

// Функция - Получить описание объекта
// 
// Возвращаемое значение:
//  Структура - возвращает описание свойств регистра.
//
Функция ПолучитьОписаниеОбъекта() Экспорт
	Возврат энргОбщегоНазначения.ПолучитьОписаниеСвойствРегистра(Метаданные.РегистрыСведений.энргСтатусВыполненияСобытий);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаСтатусВыполненияСобытий()
	
	Текст  		=
	"ВЫБРАТЬ
	|	энргСтатусВыполненияСобытийСрезПоследних.Период КАК Период,
	|	энргСтатусВыполненияСобытийСрезПоследних.Организация КАК Организация,
	|	энргСтатусВыполненияСобытийСрезПоследних.Район КАК Район,
	|	энргСтатусВыполненияСобытийСрезПоследних.ДокРегистратор КАК ДокРегистратор,
	|	энргСтатусВыполненияСобытийСрезПоследних.Ответственный КАК Ответственный,
	|	энргСтатусВыполненияСобытийСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.энргСтатусВыполненияСобытий.СрезПоследних КАК энргСтатусВыполненияСобытийСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти
	
#КонецОбласти

#КонецЕсли
